#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/paperphyte/terraform-drone/runs/run-QxPFFfsuvLC2Dv4P

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.server.module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=jUbSEA]
module.server.random_string.database_secret: Refreshing state... [id=FKgZ233erJqYUrjfrp1HKc4JoaI5jKjs]
module.server.random_string.server_secret: Refreshing state... [id=vPFoijtJNJZB7xUg4PcMLtRJxAivlR4l]
module.server.aws_ssm_parameter.rpc_secret: Refreshing state... [id=/drone/server/rpc_secret]
module.server.module.drone_server_task.aws_iam_role.ecs_task_role: Refreshing state... [id=drone-server_ecs_task_role]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-074292ec0c02841b6]
module.server.aws_iam_role.instance_helper: Refreshing state... [id=drone-instance-helper]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0dadf42dc694bcb7e]
module.server.module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=drone-20211013170624007700000001]
module.server.aws_ssm_parameter.database_secret: Refreshing state... [id=/drone/server/database_secret]
aws_cloudwatch_log_group.drone: Refreshing state... [id=drone-cluster]
module.server.module.drone_server_task.aws_iam_role_policy_attachment.task_ssm_read: Refreshing state... [id=drone-server_ecs_task_role-20211013164519793600000005]
module.server.module.drone_server_task.aws_iam_role_policy_attachment.task_execution: Refreshing state... [id=drone-server_ecs_task_role-20211013164519780100000004]
module.server.module.drone_server_task.aws_iam_policy.task_ssm_policy: Refreshing state... [id=arn:aws:iam::277223786451:policy/drone-server_task_ssm_policy]
module.server.aws_iam_role_policy_attachment.instance_helper: Refreshing state... [id=drone-instance-helper-20211013164519682400000003]
module.server.aws_iam_instance_profile.instance_helper: Refreshing state... [id=drone-instance-helper]
module.server.module.drone_server_task.aws_iam_role_policy_attachment.task_kms: Refreshing state... [id=drone-server_ecs_task_role-20211013164519668700000002]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-north-1:277223786451:cluster/drone-cluster]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a9ad92e79fb6b0fd]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0008a9d765274cbc7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03b9946a49e2d7c7f]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-05d70530cbbdd3de4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0533ea21625b519d2]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04835de384862f0b6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-082c377a26e190e80]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07ca98e1dcf74d47e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-026f77cde025f255b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-069e358eb52628922]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a1ad57e61f6e3788]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01cb83be292135123]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-051dfed3bdfa979fc]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07bc8f72b75e979e5]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-026f77cde025f255b1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-06baac68193760ef9]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d189371806c4dc5d]
module.server.aws_security_group.db: Refreshing state... [id=sg-0f030f521ca4c2545]
module.server.aws_s3_bucket.drone_build_log_storage: Refreshing state... [id=drone.paperphyte.com-console-logs]
module.server.module.drone_server_task.aws_security_group.service_sg: Refreshing state... [id=sg-081a036f662f3d400]
module.server.module.drone_lb.aws_lb_target_group.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:targetgroup/drone-target-group/48855de92e8afc88]
module.server.module.drone_lb.aws_service_discovery_private_dns_namespace.private_dns_namespace: Refreshing state... [id=ns-hjadiwh7h27udzyx]
module.server.module.drone_lb.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-north-1:277223786451:certificate/62631c8e-cc9f-4e3f-83aa-db7da3024e74]
module.server.module.drone_lb.aws_security_group.lb: Refreshing state... [id=sg-0f95737b9ea2b3d3f]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a9ad92e79fb6b0fd1080289494]
module.server.module.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=drone-20211013170624577400000002]
module.server.aws_security_group_rule.sb_default_egress: Refreshing state... [id=sgrule-2435133580]
module.server.aws_security_group_rule.db_self: Refreshing state... [id=sgrule-4057359195]
module.server.module.drone_server_task.aws_security_group_rule.service_default_egress: Refreshing state... [id=sgrule-1289973954]
module.server.aws_security_group_rule.db_drone_task: Refreshing state... [id=sgrule-4068768885]
module.server.module.drone_lb.aws_security_group_rule.lb_egress: Refreshing state... [id=sgrule-3624004551]
module.server.module.drone_lb.aws_security_group_rule.lb_ingress: Refreshing state... [id=sgrule-4175306693]
module.server.module.drone_lb.aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:loadbalancer/app/drone-lb/c95e504b50dd5849]
module.server.aws_security_group_rule.lb_grafana_ingress_rule: Refreshing state... [id=sgrule-2950454811]
module.server.aws_security_group_rule.ssl_ingress: Refreshing state... [id=sgrule-2104001396]
module.server.module.drone_server_task.aws_service_discovery_service.discovery_service: Refreshing state... [id=srv-mkp4bi2zbaj6byu6]
module.server.module.drone_lb.aws_route53_record.cert_validation["drone.paperphyte.com"]: Refreshing state... [id=Z2V3GGOJG8ZCUS__263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com._CNAME]
module.server.module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=drone]
module.server.module.drone_lb.aws_acm_certificate_validation.cert_validation: Refreshing state... [id=2021-10-13 16:46:12 +0000 UTC]
module.server.module.drone_lb.aws_lb_listener.public: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:listener/app/drone-lb/c95e504b50dd5849/a41dd8f171e9ef7e]
module.server.module.drone_lb.aws_route53_record.lb_public_url: Refreshing state... [id=Z2V3GGOJG8ZCUS_drone.paperphyte.com_A]
module.server.module.drone_lb.aws_lb_listener.https_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-north-1:277223786451:listener/app/drone-lb/c95e504b50dd5849/6ac6c77e60c12033]
module.server.aws_ssm_parameter.data_source: Refreshing state... [id=/drone/db/datasource]
module.server.aws_instance.instance_helper: Refreshing state... [id=i-01422b36004ab438f]
module.server.aws_iam_policy.server_task_policy: Refreshing state... [id=arn:aws:iam::277223786451:policy/server_task_policy]
module.server.module.drone_server_task.aws_ecs_task_definition.task_definition: Refreshing state... [id=drone-server]
module.server.aws_iam_role_policy_attachment.server_task_custom: Refreshing state... [id=drone-server_ecs_task_role-20211013170338517900000001]
module.server.module.drone_server_task.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:eu-north-1:277223786451:service/drone-cluster/drone-server]
module.server.module.drone_server_task.aws_appautoscaling_target.ecs_service: Refreshing state... [id=service/drone-cluster/drone-server]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.server.module.drone_server_task.aws_ecs_task_definition.task_definition has been changed
  ~ resource "aws_ecs_task_definition" "task_definition" {
        id                       = "drone-server"
      + tags                     = {}
        # (11 unchanged attributes hidden)
    }
  # module.server.module.db.module.db_instance.aws_db_instance.this[0] has been changed
  ~ resource "aws_db_instance" "this" {
        id                                    = "drone"
      ~ latest_restorable_time                = "2021-10-14T16:31:53Z" -> "2021-10-16T10:18:44Z"
        name                                  = "drone"
        tags                                  = {
            "Name" = "drone"
        }
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.defaultrunner.aws_autoscaling_group.provider will be created
  + resource "aws_autoscaling_group" "provider" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-04835de384862f0b6",
          + "subnet-0533ea21625b519d2",
          + "subnet-082c377a26e190e80",
        ]
      + wait_for_capacity_timeout = "0"

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = "lowest-price"
              + spot_instance_pools                      = 1
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = "$Latest"
                }

              + override {
                  + instance_type     = "t3.micro"
                  + weighted_capacity = "1"
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "drone_micro-tasks"
        }
    }

  # module.defaultrunner.aws_ecs_capacity_provider.provider will be created
  + resource "aws_ecs_capacity_provider" "provider" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "DRONE_MICRO"
      + tags_all = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = "DISABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 4
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 95
            }
        }
    }

  # module.defaultrunner.aws_iam_instance_profile.ecs_instance will be created
  + resource "aws_iam_instance_profile" "ecs_instance" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "drone_micro_ecs_instance_profile"
      + path        = "/"
      + role        = "drone_micro-ecs-instance-role"
      + tags_all    = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.defaultrunner.aws_iam_role.ecs_instance will be created
  + resource "aws_iam_role" "ecs_instance" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "spotfleet.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "drone_micro-ecs-instance-role"
      + name_prefix           = (known after apply)
      + path                  = "/ecs/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.defaultrunner.aws_iam_role_policy_attachment.ecs_ec2_cloudwatch_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_ec2_cloudwatch_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      + role       = (known after apply)
    }

  # module.defaultrunner.aws_iam_role_policy_attachment.ecs_ec2_ecr_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_ec2_ecr_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess"
      + role       = (known after apply)
    }

  # module.defaultrunner.aws_iam_role_policy_attachment.ecs_ec2_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_ec2_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.defaultrunner.aws_iam_role_policy_attachment.ecs_spotfleetscale_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_spotfleetscale_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetAutoscaleRole"
      + role       = (known after apply)
    }

  # module.defaultrunner.aws_launch_template.spot_instance will be created
  + resource "aws_launch_template" "spot_instance" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "false"
      + id                     = (known after apply)
      + image_id               = "ami-02aa54802a2c06c02"
      + instance_type          = "t3.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + tags_all               = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + user_data              = "I2Nsb3VkLWNvbmZpZwoKcnVuY21kOgogIC0gWyBzaCwgLWMsICJzZWQgLWkgJ3MvMTAyNC8xMDI0MDAwL2c7IHMvNDA5Ni8xMDI0MDAwL2cnIC9ldGMvc3lzY29uZmlnL2RvY2tlciIgXQogIC0gWyBzaCwgLWMsICJzZXJ2aWNlIGRvY2tlciByZXN0YXJ0Il0KCndyaXRlX2ZpbGVzOgogIC0gcGF0aDogL2V0Yy9lY3MvZWNzLmNvbmZpZwogICAgY29udGVudDogfAogICAgICBFQ1NfQ0xVU1RFUj1kcm9uZS1jbHVzdGVyCiAgICAgIEVDU19SRVNFUlZFRF9NRU1PUlk9MTI4CiAgICAgIEVDU19FTkFCTEVfU1BPVF9JTlNUQU5DRV9EUkFJTklORz10cnVl"
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

  # module.defaultrunner.aws_security_group.runner will be created
  + resource "aws_security_group" "runner" {
      + arn                    = (known after apply)
      + description            = "Restrict access to drone_runner."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "drone-runner-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0dadf42dc694bcb7e"
    }

  # module.defaultrunner.aws_security_group_rule.runner_default_egress will be created
  + resource "aws_security_group_rule" "runner_default_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Outgoing service traffic rule"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.defaultrunner.aws_security_group_rule.runner_ingress will be created
  + resource "aws_security_group_rule" "runner_ingress" {
      + description              = "Drone CI/CD build agents to access"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-081a036f662f3d400"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.server.aws_instance.instance_helper must be replaced
-/+ resource "aws_instance" "instance_helper" {
      ~ ami                                  = "ami-02ed85945b0e46f6f" -> "ami-02aa54802a2c06c02" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-north-1:277223786451:instance/i-01422b36004ab438f" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "eu-north-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-01422b36004ab438f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "" -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      ~ outpost_arn                          = "" -> (known after apply)
      ~ password_data                        = "" -> (known after apply)
      ~ placement_group                      = "" -> (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-06d739f52e355e521" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-127.eu-north-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.127" -> (known after apply)
      ~ public_dns                           = "" -> (known after apply)
      ~ public_ip                            = "" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "drone-instance-helper"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09597d44e4a15eab2" -> (known after apply)
          ~ volume_size           = 30 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # module.defaultrunner.module.drone_runner_task.aws_appautoscaling_target.ecs_service will be created
  + resource "aws_appautoscaling_target" "ecs_service" {
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/drone-cluster/drone_micro-runner"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.defaultrunner.module.drone_runner_task.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "drone_micro-runner"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 1
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-04835de384862f0b6",
              + "subnet-0533ea21625b519d2",
              + "subnet-082c377a26e190e80",
            ]
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.defaultrunner.module.drone_runner_task.aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + environment      = [
                      + {
                          + name  = "DRONE_DEBUG"
                          + value = "true"
                        },
                      + {
                          + name  = "DRONE_DOCKER_STREAM_PULL"
                          + value = "true"
                        },
                      + {
                          + name  = "DRONE_RPC_DEBUG"
                          + value = "true"
                        },
                      + {
                          + name  = "DRONE_RPC_DUMP_HTTP"
                          + value = "true"
                        },
                      + {
                          + name  = "DRONE_RPC_DUMP_HTTP_BODY"
                          + value = "true"
                        },
                      + {
                          + name  = "DRONE_RPC_HOST"
                          + value = "ns-hjadiwh7h27udzyx"
                        },
                      + {
                          + name  = "DRONE_RPC_PROTO"
                          + value = "http"
                        },
                      + {
                          + name  = "DRONE_RUNNER_CAPACITY"
                          + value = "2"
                        },
                      + {
                          + name  = "DRONE_RUNNER_LABELS"
                          + value = "instance:micro"
                        },
                      + {
                          + name  = "DRONE_RUNNER_NAME"
                          + value = "runner-micro"
                        },
                      + {
                          + name  = "DRONE_TRACE"
                          + value = "true"
                        },
                    ]
                  + image            = "277223786451.dkr.ecr.eu-north-1.amazonaws.com/drone/drone-runner-docker:1.6.3"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "drone-cluster"
                          + awslogs-region        = "eu-north-1"
                          + awslogs-stream-prefix = "/drone-drone_micro-runner"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/var/run/docker.sock"
                          + readOnly      = true
                          + sourceVolume  = "dockersock"
                        },
                    ]
                  + name             = "drone-drone_micro-runner"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "DRONE_RPC_SECRET"
                          + valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/server/rpc_secret"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "drone_micro-runner"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + task_role_arn            = (known after apply)

      + volume {
          + host_path = "/var/run/docker.sock"
          + name      = "dockersock"
        }
    }

  # module.defaultrunner.module.drone_runner_task.aws_iam_policy.task_ssm_policy will be created
  + resource "aws_iam_policy" "task_ssm_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "drone-drone_micro-runner_task_ssm_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:EncryptionContext:PARAMETER_ARN = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
    }

  # module.defaultrunner.module.drone_runner_task.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "drone-drone_micro-runner_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.defaultrunner.module.drone_runner_task.aws_iam_role_policy_attachment.task_execution will be created
  + resource "aws_iam_role_policy_attachment" "task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.defaultrunner.module.drone_runner_task.aws_iam_role_policy_attachment.task_kms will be created
  + resource "aws_iam_role_policy_attachment" "task_kms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.defaultrunner.module.drone_runner_task.aws_iam_role_policy_attachment.task_ssm_read will be created
  + resource "aws_iam_role_policy_attachment" "task_ssm_read" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = (known after apply)
    }

  # module.defaultrunner.module.drone_runner_task.aws_security_group.service_sg will be created
  + resource "aws_security_group" "service_sg" {
      + arn                    = (known after apply)
      + description            = "Restrict access to service."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "drone-drone_micro-runner-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0dadf42dc694bcb7e"
    }

  # module.defaultrunner.module.drone_runner_task.aws_security_group_rule.service_default_egress will be created
  + resource "aws_security_group_rule" "service_default_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Outgoing service traffic rule"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.defaultrunner.module.drone_runner_task.aws_service_discovery_service.discovery_service will be created
  + resource "aws_service_discovery_service" "discovery_service" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "drone_micro-runner"
      + namespace_id  = (known after apply)
      + tags_all      = {
          + "Environment" = "prod"
          + "Project"     = "drone"
          + "Terraform"   = "true"
        }

      + dns_config {
          + namespace_id   = "ns-hjadiwh7h27udzyx"
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 10
        }
    }

  # module.server.module.drone_lb.aws_acm_certificate_validation.cert_validation must be replaced
-/+ resource "aws_acm_certificate_validation" "cert_validation" {
      ~ id                      = "2021-10-13 16:46:12 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.server.module.drone_lb.aws_route53_record.cert_validation["drone.paperphyte.com"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn            = "_263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com" -> (known after apply)
      ~ id              = "Z2V3GGOJG8ZCUS__263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com._CNAME" -> (known after apply)
        name            = "_263bbd50919b3f18266c5ba23946d2eb.drone.paperphyte.com"
      ~ zone_id         = "Z2V3GGOJG8ZCUS" -> "kalle" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.server.module.drone_lb.aws_route53_record.lb_public_url must be replaced
-/+ resource "aws_route53_record" "lb_public_url" {
      ~ fqdn            = "drone.paperphyte.com" -> (known after apply)
      ~ id              = "Z2V3GGOJG8ZCUS_drone.paperphyte.com_A" -> (known after apply)
        name            = "drone.paperphyte.com"
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z2V3GGOJG8ZCUS" -> "kalle" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.server.module.drone_server_task.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:eu-north-1:277223786451:service/drone-cluster/drone-server"
        name                               = "drone-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-north-1:277223786451:task-definition/drone-server:6" -> (known after apply)
        # (13 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

  # module.server.module.drone_server_task.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-north-1:277223786451:task-definition/drone-server:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "AWS_DEFAULT_REGION"
                          - value = "eu-north-1"
                        },
                      - {
                          - name  = "AWS_REGION"
                          - value = "eu-north-1"
                        },
                      - {
                          - name  = "DRONE_AGENTS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DRONE_CLEANUP_DEADLINE_PENDING"
                          - value = "72h"
                        },
                      - {
                          - name  = "DRONE_CLEANUP_DEADLINE_RUNNING"
                          - value = "6h"
                        },
                      - {
                          - name  = "DRONE_CLEANUP_INTERVAL"
                          - value = "24h"
                        },
                      - {
                          - name  = "DRONE_DATABASE_DRIVER"
                          - value = "postgres"
                        },
                      - {
                          - name  = "DRONE_GITHUB_SERVER"
                          - value = "https://github.com"
                        },
                      - {
                          - name  = "DRONE_HTTP_SSL_REDIRECT"
                          - value = "false"
                        },
                      - {
                          - name  = "DRONE_LOGS_DEBUG"
                          - value = "true"
                        },
                      - {
                          - name  = "DRONE_LOGS_TRACE"
                          - value = "true"
                        },
                      - {
                          - name  = "DRONE_REPOSITORY_FILTER"
                          - value = "paperphyte"
                        },
                      - {
                          - name  = "DRONE_RPC_SERVER"
                          - value = "https://drone.paperphyte.com"
                        },
                      - {
                          - name  = "DRONE_S3_BUCKET"
                          - value = "drone.paperphyte.com-console-logs"
                        },
                      - {
                          - name  = "DRONE_SERVER_HOST"
                          - value = "drone.paperphyte.com"
                        },
                      - {
                          - name  = "DRONE_SERVER_PROTO"
                          - value = "https"
                        },
                      - {
                          - name  = "DRONE_TLS_AUTOCERT"
                          - value = "false"
                        },
                      - {
                          - name  = "DRONE_USER_CREATE"
                          - value = "username:krusipo,machine:false,admin:true"
                        },
                      - {
                          - name  = "DRONE_USER_FILTER"
                          - value = "paperphyte"
                        },
                    ]
                  - essential        = true
                  - image            = "277223786451.dkr.ecr.eu-north-1.amazonaws.com/drone/drone:v2.4.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "drone-cluster"
                          - awslogs-region        = "eu-north-1"
                          - awslogs-stream-prefix = "/drone-server"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "drone-server"
                  - portMappings     = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DRONE_GITHUB_CLIENT_ID"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/github/client_id"
                        },
                      - {
                          - name      = "DRONE_GITHUB_CLIENT_SECRET"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/github/client_secret"
                        },
                      - {
                          - name      = "DRONE_DATABASE_DATASOURCE"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/db/datasource"
                        },
                      - {
                          - name      = "DRONE_RPC_SECRET"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/server/rpc_secret"
                        },
                      - {
                          - name      = "DRONE_DATABASE_SECRET"
                          - valueFrom = "arn:aws:ssm:eu-north-1:277223786451:parameter/drone/server/database_secret"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "drone-server" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
      - tags                     = {} -> null
        # (8 unchanged attributes hidden)
    }

Plan: 28 to add, 1 to change, 5 to destroy.


```
</details>
*Pusher: @krusipo, Action: `pull_request`*